# Пользователь вводит Имя, Возраст и Город, сформировать
# приветственное сообщение путем форматирования 3-мя способами

# 1
name = input('name:')
age = input('age:')
city = input('city:')
print('привет,', name, 'из города', city, 'тебе уже', age, 'поздравляем!')

# 1
userlist = input('введите ваше имя, возраст и город').split()

# print('привет, ', userlist)
